Zh-Commander/CommentTranslator/temp/code_split_output/Inc/stm32f1xx_hal_rcc.part2.h
/**
  * @brief  Macro to configure the External Low Speed oscillator (LSE).
  *         配置外部低速振荡器(LSE)的宏。
  * @note Transitions LSE Bypass to LSE On and LSE On to LSE Bypass are not supported by this macro.
  *       注意：该宏不支持从 LSE 旁路模式切换到 LSE 开启模式，也不支持从 LSE 开启模式切换到旁路模式。
  * @note   As the LSE is in the Backup domain and write access is denied to
  *         this domain after reset, you have to enable write access using
  *         @ref HAL_PWR_EnableBkUpAccess() function before to configure the LSE
  *         (to be done once after reset).
  *       注意：由于 LSE 处于备份域，复位后对该域的写访问被禁止，
  *       因此在配置 LSE 之前，必须使用 @ref HAL_PWR_EnableBkUpAccess() 函数使能写访问
  *       (复位后执行一次即可)。
  * @note   After enabling the LSE (RCC_LSE_ON or RCC_LSE_BYPASS), the application
  *         software should wait on LSERDY flag to be set indicating that LSE clock
  *         is stable and can be used to clock the RTC.
  *       注意：在使能 LSE (RCC_LSE_ON 或 RCC_LSE_BYPASS) 之后，应用程序软件应该等待 
  *       LSERDY 标志位被置位，这表明 LSE 时钟已稳定，可用于驱动 RTC。
  * @param  __STATE__ specifies the new state of the LSE.
  *         指定 LSE 的新状态。
  *         This parameter can be one of the following values:
  *         该参数可以是以下值之一：
  *            @arg @ref RCC_LSE_OFF turn OFF the LSE oscillator, LSERDY flag goes low after
  *                              6 LSE oscillator clock cycles.
  *            关闭 LSE 振荡器，LSERDY 标志位在 6 个 LSE 振荡器时钟周期后变低。
  *            @arg @ref RCC_LSE_ON turn ON the LSE oscillator.
  *            开启 LSE 振荡器。
  *            @arg @ref RCC_LSE_BYPASS LSE oscillator bypassed with external clock.
  *            LSE 振荡器被外部时钟旁路。
  */
#define __HAL_RCC_LSE_CONFIG(__STATE__)                                     \
                    do{                                                     \
                      if ((__STATE__) == RCC_LSE_ON)                        \
                      {                                                     \
                        SET_BIT(RCC->BDCR, RCC_BDCR_LSEON);                   \
                      }                                                     \
                      else if ((__STATE__) == RCC_LSE_OFF)                  \
                      {                                                     \
                        CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);                 \
                        CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);                \
                      }                                                     \
                      else if ((__STATE__) == RCC_LSE_BYPASS)               \
                      {                                                     \
                        SET_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);                  \
                        SET_BIT(RCC->BDCR, RCC_BDCR_LSEON);                   \
                      }                                                     \
                      else                                                  \
                      {                                                     \
                        CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEON);                 \
                        CLEAR_BIT(RCC->BDCR, RCC_BDCR_LSEBYP);                \
                      }                                                     \
                    }while(0U)

/**
  * @}
  */

/** @defgroup RCC_PLL_Configuration PLL Configuration
  *         PLL 配置
  * @{
  */

/** @brief Macro to enable the main PLL.
  *        使能主 PLL 的宏。
  * @note   After enabling the main PLL, the application software should wait on
  *         PLLRDY flag to be set indicating that PLL clock is stable and can
  *         be used as system clock source.
  *       注意：使能主 PLL 后，应用软件应等待 PLLRDY 标志位被置位，
  *       以表明 PLL 时钟稳定，可用作系统时钟源。
  * @note   The main PLL is disabled by hardware when entering STOP and STANDBY modes.
  *       注意：进入停止和待机模式时，硬件会自动禁用主 PLL。
  */
#define __HAL_RCC_PLL_ENABLE()          (*(__IO uint32_t *) RCC_CR_PLLON_BB = ENABLE)

/** @brief Macro to disable the main PLL.
  *        禁用主 PLL 的宏。
  * @note   The main PLL can not be disabled if it is used as system clock source
  *       注意：如果主 PLL 被用作系统时钟源，则不能被禁用。
  */
#define __HAL_RCC_PLL_DISABLE()         (*(__IO uint32_t *) RCC_CR_PLLON_BB = DISABLE)

/** @brief Macro to configure the main PLL clock source and multiplication factors.
  *        配置主 PLL 时钟源和倍频因子的宏。
  * @note   This function must be used only when the main PLL is disabled.
  *       注意：此功能必须在主 PLL 禁用时使用。
  *
  * @param  __RCC_PLLSOURCE__ specifies the PLL entry clock source.
  *         指定 PLL 入口时钟源。
  *          This parameter can be one of the following values:
  *          该参数可以是以下值之一：
  *            @arg @ref RCC_PLLSOURCE_HSI_DIV2 HSI oscillator clock selected as PLL clock entry
  *            HSI 振荡器时钟被选为 PLL 时钟输入（HSI 2分频）
  *            @arg @ref RCC_PLLSOURCE_HSE HSE oscillator clock selected as PLL clock entry
  *            HSE 振荡器时钟被选为 PLL 时钟输入
  * @param  __PLLMUL__ specifies the multiplication factor for PLL VCO output clock
  *         指定 PLL VCO 输出时钟的倍频因子
  *          This parameter can be one of the following values:
  *          该参数可以是以下值之一：
  *             @arg @ref RCC_PLL_MUL4   PLLVCO = PLL clock entry x 4
  *             @arg @ref RCC_PLL_MUL6   PLLVCO = PLL clock entry x 6
  @if STM32F105xC
  *             @arg @ref RCC_PLL_MUL6_5 PLLVCO = PLL clock entry x 6.5
  @elseif STM32F107xC
  *             @arg @ref RCC_PLL_MUL6_5 PLLVCO = PLL clock entry x 6.5
  @else
  *             @arg @ref RCC_PLL_MUL2   PLLVCO = PLL clock entry x 2
  *             @arg @ref RCC_PLL_MUL3   PLLVCO = PLL clock entry x 3
  *             @arg @ref RCC_PLL_MUL10  PLLVCO = PLL clock entry x 10
  *             @arg @ref RCC_PLL_MUL11  PLLVCO = PLL clock entry x 11
  *             @arg @ref RCC_PLL_MUL12  PLLVCO = PLL clock entry x 12
  *             @arg @ref RCC_PLL_MUL13  PLLVCO = PLL clock entry x 13
  *             @arg @ref RCC_PLL_MUL14  PLLVCO = PLL clock entry x 14
  *             @arg @ref RCC_PLL_MUL15  PLLVCO = PLL clock entry x 15
  *             @arg @ref RCC_PLL_MUL16  PLLVCO = PLL clock entry x 16
  @endif
  *             @arg @ref RCC_PLL_MUL8   PLLVCO = PLL clock entry x 8
  *             @arg @ref RCC_PLL_MUL9   PLLVCO = PLL clock entry x 9
  *
  */
#define __HAL_RCC_PLL_CONFIG(__RCC_PLLSOURCE__, __PLLMUL__)\
          MODIFY_REG(RCC->CFGR, (RCC_CFGR_PLLSRC | RCC_CFGR_PLLMULL),((__RCC_PLLSOURCE__) | (__PLLMUL__) ))

/** @brief  Get oscillator clock selected as PLL input clock
  *         获取被选为 PLL 输入时钟的振荡器时钟
  * @retval The clock source used for PLL entry. The returned value can be one
  *         of the following:
  *         用于 PLL 入口的时钟源。返回值可以是以下之一：
  *             @arg @ref RCC_PLLSOURCE_HSI_DIV2 HSI oscillator clock selected as PLL input clock
  *             HSI 振荡器时钟被选为 PLL 输入时钟
  *             @arg @ref RCC_PLLSOURCE_HSE HSE oscillator clock selected as PLL input clock
  *             HSE 振荡器时钟被选为 PLL 输入时钟
  */
#define __HAL_RCC_GET_PLL_OSCSOURCE() ((uint32_t)(READ_BIT(RCC->CFGR, RCC_CFGR_PLLSRC)))

/**
  * @}
  */

/** @defgroup RCC_Get_Clock_source Get Clock source
  *         获取时钟源
  * @{
  */

/**
  * @brief  Macro to configure the system clock source.
  *         配置系统时钟源的宏。
  * @param  __SYSCLKSOURCE__ specifies the system clock source.
  *         指定系统时钟源。
  *          This parameter can be one of the following values:
  *          该参数可以是以下值之一：
  *              @arg @ref RCC_SYSCLKSOURCE_HSI HSI oscillator is used as system clock source.
  *              HSI 振荡器用作系统时钟源。
  *              @arg @ref RCC_SYSCLKSOURCE_HSE HSE oscillator is used as system clock source.
  *              HSE 振荡器用作系统时钟源。
  *              @arg @ref RCC_SYSCLKSOURCE_PLLCLK PLL output is used as system clock source.
  *              PLL 输出用作系统时钟源。
  */
#define __HAL_RCC_SYSCLK_CONFIG(__SYSCLKSOURCE__) \
                  MODIFY_REG(RCC->CFGR, RCC_CFGR_SW, (__SYSCLKSOURCE__))

/** @brief  Macro to get the clock source used as system clock.
  *         获取用作系统时钟的时钟源的宏。
  * @retval The clock source used as system clock. The returned value can be one
  *         of the following:
  *         用作系统时钟的时钟源。返回值可以是以下之一：
  *             @arg @ref RCC_SYSCLKSOURCE_STATUS_HSI HSI used as system clock
  *             HSI 用作系统时钟
  *             @arg @ref RCC_SYSCLKSOURCE_STATUS_HSE HSE used as system clock
  *             HSE 用作系统时钟
  *             @arg @ref RCC_SYSCLKSOURCE_STATUS_PLLCLK PLL used as system clock
  *             PLL 用作系统时钟
  */
#define __HAL_RCC_GET_SYSCLK_SOURCE() ((uint32_t)(READ_BIT(RCC->CFGR,RCC_CFGR_SWS)))

/**
  * @}
  */

/** @defgroup RCCEx_MCOx_Clock_Config RCC Extended MCOx Clock Config
  *         RCC 扩展 MCOx 时钟配置
  * @{
  */

#if   defined(RCC_CFGR_MCO_3)
/** @brief  Macro to configure the MCO clock.
  *         配置 MCO 时钟的宏。
  * @param  __MCOCLKSOURCE__ specifies the MCO clock source.
  *         指定 MCO 时钟源。
  *         This parameter can be one of the following values:
  *         该参数可以是以下值之一：
  *            @arg @ref RCC_MCO1SOURCE_NOCLOCK      No clock selected as MCO clock
  *            无时钟被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_SYSCLK       System clock (SYSCLK) selected as MCO clock
  *            系统时钟 (SYSCLK) 被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_HSI          HSI selected as MCO clock
  *            HSI 被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_HSE          HSE selected as MCO clock
  *            HSE 被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_PLLCLK       PLL clock divided by 2 selected as MCO clock
  *            PLL 时钟 2 分频被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_PLL2CLK      PLL2 clock selected by 2 selected as MCO clock
  *            PLL2 时钟被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_PLL3CLK_DIV2 PLL3 clock divided by 2 selected as MCO clock
  *            PLL3 时钟 2 分频被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_EXT_HSE XT1  external 3-25 MHz oscillator clock selected (for Ethernet) as MCO clock
  *            外部 3-25 MHz 振荡器时钟被选为 MCO 时钟 (用于以太网)
  *            @arg @ref RCC_MCO1SOURCE_PLL3CLK      PLL3 clock selected (for Ethernet) as MCO clock
  *            PLL3 时钟被选为 MCO 时钟 (用于以太网)
  * @param  __MCODIV__ specifies the MCO clock prescaler.
  *         指定 MCO 时钟预分频器。
  *         This parameter can be one of the following values:
  *         该参数可以是以下值之一：
  *            @arg @ref RCC_MCODIV_1 No division applied on MCO clock source
  *            MCO 时钟源不进行分频
  */
#else
/** @brief  Macro to configure the MCO clock.
  *         配置 MCO 时钟的宏。
  * @param  __MCOCLKSOURCE__ specifies the MCO clock source.
  *         指定 MCO 时钟源。
  *         This parameter can be one of the following values:
  *         该参数可以是以下值之一：
  *            @arg @ref RCC_MCO1SOURCE_NOCLOCK No clock selected as MCO clock
  *            无时钟被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_SYSCLK  System clock (SYSCLK) selected as MCO clock
  *            系统时钟 (SYSCLK) 被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_HSI HSI selected as MCO clock
  *            HSI 被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_HSE HSE selected as MCO clock
  *            HSE 被选为 MCO 时钟
  *            @arg @ref RCC_MCO1SOURCE_PLLCLK  PLL clock divided by 2 selected as MCO clock
  *            PLL 时钟 2 分频被选为 MCO 时钟
  * @param  __MCODIV__ specifies the MCO clock prescaler.
  *         指定 MCO 时钟预分频器。
  *         This parameter can be one of the following values:
  *         该参数可以是以下值之一：
  *            @arg @ref RCC_MCODIV_1 No division applied on MCO clock source
  *            MCO 时钟源不进行分频
  */
#endif

#define __HAL_RCC_MCO1_CONFIG(__MCOCLKSOURCE__, __MCODIV__) \
                 MODIFY_REG(RCC->CFGR, RCC_CFGR_MCO, (__MCOCLKSOURCE__))


/**
  * @}
  */

