Zh-Commander/CommentTranslator/temp/code_split_output/Inc/stm32f1xx_hal_rcc.part2.h
/** @defgroup RCC_RTC_Clock_Configuration RCC RTC Clock Configuration
*           RCC RTC 时钟配置
* @{
*/

/** @brief Macro to configure the RTC clock (RTCCLK).
  *        配置 RTC 时钟 (RTCCLK) 的宏。
  * @note   As the RTC clock configuration bits are in the Backup domain and write
  *         access is denied to this domain after reset, you have to enable write
  *         access using the Power Backup Access macro before to configure
  *         the RTC clock source (to be done once after reset).
  *       注意：由于 RTC 时钟配置位处于备份域，复位后对该域的写访问被禁止，
  *       因此在配置 RTC 时钟源之前，必须使用电源备份访问宏使能写访问
  *       (复位后执行一次即可)。
  * @note   Once the RTC clock is configured it can't be changed unless the
  *         Backup domain is reset using @ref __HAL_RCC_BACKUPRESET_FORCE() macro, or by
  *         a Power On Reset (POR).
  *       注意：RTC 时钟一旦配置，就无法更改，除非使用 @ref __HAL_RCC_BACKUPRESET_FORCE() 宏复位备份域，
  *       或者通过上电复位 (POR)。
  *
  * @param  __RTC_CLKSOURCE__ specifies the RTC clock source.
  *         指定 RTC 时钟源。
  *          This parameter can be one of the following values:
  *          该参数可以是以下值之一：
  *             @arg @ref RCC_RTCCLKSOURCE_NO_CLK No clock selected as RTC clock
  *             无时钟被选为 RTC 时钟
  *             @arg @ref RCC_RTCCLKSOURCE_LSE LSE selected as RTC clock
  *             LSE 被选为 RTC 时钟
  *             @arg @ref RCC_RTCCLKSOURCE_LSI LSI selected as RTC clock
  *             LSI 被选为 RTC 时钟
  *             @arg @ref RCC_RTCCLKSOURCE_HSE_DIV128 HSE divided by 128 selected as RTC clock
  *             HSE 128 分频被选为 RTC 时钟
  * @note   If the LSE or LSI is used as RTC clock source, the RTC continues to
  *         work in STOP and STANDBY modes, and can be used as wakeup source.
  *         However, when the HSE clock is used as RTC clock source, the RTC
  *         cannot be used in STOP and STANDBY modes.
  *       注意：如果 LSE 或 LSI 用作 RTC 时钟源，RTC 在停止和待机模式下继续工作，
  *       并可用作唤醒源。但是，当 HSE 时钟用作 RTC 时钟源时，RTC 不能在停止和待机模式下使用。
  * @note   The maximum input clock frequency for RTC is 1MHz (when using HSE as
  *         RTC clock source).
  *       注意：RTC 的最大输入时钟频率为 1MHz (当使用 HSE 作为 RTC 时钟源时)。
  */
#define __HAL_RCC_RTC_CONFIG(__RTC_CLKSOURCE__) MODIFY_REG(RCC->BDCR, RCC_BDCR_RTCSEL, (__RTC_CLKSOURCE__))

/** @brief Macro to get the RTC clock source.
  *        获取 RTC 时钟源的宏。
  * @retval The clock source can be one of the following values:
  *         时钟源可以是以下值之一：
  *            @arg @ref RCC_RTCCLKSOURCE_NO_CLK No clock selected as RTC clock
  *            无时钟被选为 RTC 时钟
  *            @arg @ref RCC_RTCCLKSOURCE_LSE LSE selected as RTC clock
  *            LSE 被选为 RTC 时钟
  *            @arg @ref RCC_RTCCLKSOURCE_LSI LSI selected as RTC clock
  *            LSI 被选为 RTC 时钟
  *            @arg @ref RCC_RTCCLKSOURCE_HSE_DIV128 HSE divided by 128 selected as RTC clock
  *            HSE 128 分频被选为 RTC 时钟
  */
#define __HAL_RCC_GET_RTC_SOURCE() (READ_BIT(RCC->BDCR, RCC_BDCR_RTCSEL))

/** @brief Macro to enable the the RTC clock.
  *        使能 RTC 时钟的宏。
  * @note   These macros must be used only after the RTC clock source was selected.
  *       注意：这些宏必须在选择了 RTC 时钟源之后使用。
  */
#define __HAL_RCC_RTC_ENABLE()          (*(__IO uint32_t *) RCC_BDCR_RTCEN_BB = ENABLE)

/** @brief Macro to disable the the RTC clock.
  *        禁用 RTC 时钟的宏。
  * @note  These macros must be used only after the RTC clock source was selected.
  *       注意：这些宏必须在选择了 RTC 时钟源之后使用。
  */
#define __HAL_RCC_RTC_DISABLE()         (*(__IO uint32_t *) RCC_BDCR_RTCEN_BB = DISABLE)

/** @brief  Macro to force the Backup domain reset.
  *         强制备份域复位的宏。
  * @note   This function resets the RTC peripheral (including the backup registers)
  *         and the RTC clock source selection in RCC_BDCR register.
  *       注意：此功能复位 RTC 外设 (包括备份寄存器) 以及 RCC_BDCR 寄存器中的 RTC 时钟源选择。
  */
#define __HAL_RCC_BACKUPRESET_FORCE()   (*(__IO uint32_t *) RCC_BDCR_BDRST_BB = ENABLE)

/** @brief  Macros to release the Backup domain reset.
  *         释放备份域复位的宏。
  */
#define __HAL_RCC_BACKUPRESET_RELEASE() (*(__IO uint32_t *) RCC_BDCR_BDRST_BB = DISABLE)

/**
  * @}
  */

/** @defgroup RCC_Flags_Interrupts_Management Flags Interrupts Management
  *         标志与中断管理
  * @brief macros to manage the specified RCC Flags and interrupts.
  *        管理指定 RCC 标志和中断的宏。
  * @{
  */

/** @brief Enable RCC interrupt.
  *        使能 RCC 中断。
  * @param  __INTERRUPT__ specifies the RCC interrupt sources to be enabled.
  *         指定要使能的 RCC 中断源。
  *          This parameter can be any combination of the following values:
  *          该参数可以是以下值的任意组合：
  *            @arg @ref RCC_IT_LSIRDY LSI ready interrupt
  *            LSI 就绪中断
  *            @arg @ref RCC_IT_LSERDY LSE ready interrupt
  *            LSE 就绪中断
  *            @arg @ref RCC_IT_HSIRDY HSI ready interrupt
  *            HSI 就绪中断
  *            @arg @ref RCC_IT_HSERDY HSE ready interrupt
  *            HSE 就绪中断
  *            @arg @ref RCC_IT_PLLRDY main PLL ready interrupt
  *            主 PLL 就绪中断
  @if STM32F105xx
  *            @arg @ref RCC_IT_PLL2RDY Main PLL2 ready interrupt.
  *            主 PLL2 就绪中断
  *            @arg @ref RCC_IT_PLLI2S2RDY Main PLLI2S ready interrupt.
  *            主 PLLI2S 就绪中断
  @elsif STM32F107xx
  *            @arg @ref RCC_IT_PLL2RDY Main PLL2 ready interrupt.
  *            主 PLL2 就绪中断
  *            @arg @ref RCC_IT_PLLI2S2RDY Main PLLI2S ready interrupt.
  *            主 PLLI2S 就绪中断
  @endif
  */
#define __HAL_RCC_ENABLE_IT(__INTERRUPT__) (*(__IO uint8_t *) RCC_CIR_BYTE1_ADDRESS |= (__INTERRUPT__))

/** @brief Disable RCC interrupt.
  *        禁用 RCC 中断。
  * @param  __INTERRUPT__ specifies the RCC interrupt sources to be disabled.
  *         指定要禁用的 RCC 中断源。
  *          This parameter can be any combination of the following values:
  *          该参数可以是以下值的任意组合：
  *            @arg @ref RCC_IT_LSIRDY LSI ready interrupt
  *            LSI 就绪中断
  *            @arg @ref RCC_IT_LSERDY LSE ready interrupt
  *            LSE 就绪中断
  *            @arg @ref RCC_IT_HSIRDY HSI ready interrupt
  *            HSI 就绪中断
  *            @arg @ref RCC_IT_HSERDY HSE ready interrupt
  *            HSE 就绪中断
  *            @arg @ref RCC_IT_PLLRDY main PLL ready interrupt
  *            主 PLL 就绪中断
  @if STM32F105xx
  *            @arg @ref RCC_IT_PLL2RDY Main PLL2 ready interrupt.
  *            主 PLL2 就绪中断
  *            @arg @ref RCC_IT_PLLI2S2RDY Main PLLI2S ready interrupt.
  *            主 PLLI2S 就绪中断
  @elsif STM32F107xx
  *            @arg @ref RCC_IT_PLL2RDY Main PLL2 ready interrupt.
  *            主 PLL2 就绪中断
  *            @arg @ref RCC_IT_PLLI2S2RDY Main PLLI2S ready interrupt.
  *            主 PLLI2S 就绪中断
  @endif
  */
#define __HAL_RCC_DISABLE_IT(__INTERRUPT__) (*(__IO uint8_t *) RCC_CIR_BYTE1_ADDRESS &= (uint8_t)(~(__INTERRUPT__)))

/** @brief Clear the RCC's interrupt pending bits.
  *        清除 RCC 的中断挂起位。
  * @param  __INTERRUPT__ specifies the interrupt pending bit to clear.
  *         指定要清除的中断挂起位。
  *          This parameter can be any combination of the following values:
  *          该参数可以是以下值的任意组合：
  *            @arg @ref RCC_IT_LSIRDY LSI ready interrupt.
  *            LSI 就绪中断
  *            @arg @ref RCC_IT_LSERDY LSE ready interrupt.
  *            LSE 就绪中断
  *            @arg @ref RCC_IT_HSIRDY HSI ready interrupt.
  *            HSI 就绪中断
  *            @arg @ref RCC_IT_HSERDY HSE ready interrupt.
  *            HSE 就绪中断
  *            @arg @ref RCC_IT_PLLRDY Main PLL ready interrupt.
  *            主 PLL 就绪中断
  @if STM32F105xx
  *            @arg @ref RCC_IT_PLL2RDY Main PLL2 ready interrupt.
  *            主 PLL2 就绪中断
  *            @arg @ref RCC_IT_PLLI2S2RDY Main PLLI2S ready interrupt.
  *            主 PLLI2S 就绪中断
  @elsif STM32F107xx
  *            @arg @ref RCC_IT_PLL2RDY Main PLL2 ready interrupt.
  *            主 PLL2 就绪中断
  *            @arg @ref RCC_IT_PLLI2S2RDY Main PLLI2S ready interrupt.
  *            主 PLLI2S 就绪中断
  @endif
  *            @arg @ref RCC_IT_CSS Clock Security System interrupt
  *            时钟安全系统中断
  */
#define __HAL_RCC_CLEAR_IT(__INTERRUPT__) (*(__IO uint8_t *) RCC_CIR_BYTE2_ADDRESS = (__INTERRUPT__))

/** @brief Check the RCC's interrupt has occurred or not.
  *        检查 RCC 中断是否发生。
  * @param  __INTERRUPT__ specifies the RCC interrupt source to check.
  *         指定要检查的 RCC 中断源。
  *          This parameter can be one of the following values:
  *          该参数可以是以下值之一：
  *            @arg @ref RCC_IT_LSIRDY LSI ready interrupt.
  *            LSI 就绪中断
  *            @arg @ref RCC_IT_LSERDY LSE ready interrupt.
  *            LSE 就绪中断
  *            @arg @ref RCC_IT_HSIRDY HSI ready interrupt.
  *            HSI 就绪中断
  *            @arg @ref RCC_IT_HSERDY HSE ready interrupt.
  *            HSE 就绪中断
  *            @arg @ref RCC_IT_PLLRDY Main PLL ready interrupt.
  *            主 PLL 就绪中断
  @if STM32F105xx
  *            @arg @ref RCC_IT_PLL2RDY Main PLL2 ready interrupt.
  *            主 PLL2 就绪中断
  *            @arg @ref RCC_IT_PLLI2S2RDY Main PLLI2S ready interrupt.
  *            主 PLLI2S 就绪中断
  @elsif STM32F107xx
  *            @arg @ref RCC_IT_PLL2RDY Main PLL2 ready interrupt.
  *            主 PLL2 就绪中断
  *            @arg @ref RCC_IT_PLLI2S2RDY Main PLLI2S ready interrupt.
  *            主 PLLI2S 就绪中断
  @endif
  *            @arg @ref RCC_IT_CSS Clock Security System interrupt
  *            时钟安全系统中断
  * @retval The new state of __INTERRUPT__ (TRUE or FALSE).
  *         __INTERRUPT__ 的新状态 (TRUE 或 FALSE)。
  */
#define __HAL_RCC_GET_IT(__INTERRUPT__) ((RCC->CIR & (__INTERRUPT__)) == (__INTERRUPT__))

/** @brief Set RMVF bit to clear the reset flags.
  *        设置 RMVF 位以清除复位标志。
  *         The reset flags are RCC_FLAG_PINRST, RCC_FLAG_PORRST, RCC_FLAG_SFTRST,
  *         RCC_FLAG_IWDGRST, RCC_FLAG_WWDGRST, RCC_FLAG_LPWRRST
  *         复位标志包括：引脚复位、POR/PDR 复位、软件复位、独立看门狗复位、窗口看门狗复位、低功耗复位。
  */
#define __HAL_RCC_CLEAR_RESET_FLAGS() (*(__IO uint32_t *)RCC_CSR_RMVF_BB = ENABLE)

/** @brief  Check RCC flag is set or not.
  *        检查 RCC 标志是否置位。
  * @param  __FLAG__ specifies the flag to check.
  *         指定要检查的标志。
  *          This parameter can be one of the following values:
  *          该参数可以是以下值之一：
  *            @arg @ref RCC_FLAG_HSIRDY HSI oscillator clock ready.
  *            HSI 振荡器时钟就绪
  *            @arg @ref RCC_FLAG_HSERDY HSE oscillator clock ready.
  *            HSE 振荡器时钟就绪
  *            @arg @ref RCC_FLAG_PLLRDY Main PLL clock ready.
  *            主 PLL 时钟就绪
  @if STM32F105xx
  *            @arg @ref RCC_FLAG_PLL2RDY Main PLL2 clock ready.
  *            主 PLL2 时钟就绪
  *            @arg @ref RCC_FLAG_PLLI2SRDY Main PLLI2S clock ready.
  *            主 PLLI2S 时钟就绪
  @elsif STM32F107xx
  *            @arg @ref RCC_FLAG_PLL2RDY Main PLL2 clock ready.
  *            主 PLL2 时钟就绪
  *            @arg @ref RCC_FLAG_PLLI2SRDY Main PLLI2S clock ready.
  *            主 PLLI2S 时钟就绪
  @endif
  *            @arg @ref RCC_FLAG_LSERDY LSE oscillator clock ready.
  *            LSE 振荡器时钟就绪
  *            @arg @ref RCC_FLAG_LSIRDY LSI oscillator clock ready.
  *            LSI 振荡器时钟就绪
  *            @arg @ref RCC_FLAG_PINRST  Pin reset.
  *            引脚复位
  *            @arg @ref RCC_FLAG_PORRST  POR/PDR reset.
  *            POR/PDR 复位
  *            @arg @ref RCC_FLAG_SFTRST  Software reset.
  *            软件复位
  *            @arg @ref RCC_FLAG_IWDGRST Independent Watchdog reset.
  *            独立看门狗复位
  *            @arg @ref RCC_FLAG_WWDGRST Window Watchdog reset.
  *            窗口看门狗复位
  *            @arg @ref RCC_FLAG_LPWRRST Low Power reset.
  *            低功耗复位
  * @retval The new state of __FLAG__ (TRUE or FALSE).
  *         __FLAG__ 的新状态 (TRUE 或 FALSE)。
  */
#define __HAL_RCC_GET_FLAG(__FLAG__) (((((__FLAG__) >> 5U) == CR_REG_INDEX)?   RCC->CR   : \
                                      ((((__FLAG__) >> 5U) == BDCR_REG_INDEX)? RCC->BDCR : \
                                                                              RCC->CSR)) & (1U << ((__FLAG__) & RCC_FLAG_MASK)))

/**
  * @}
  */

/**
  * @}
  */

/* Include RCC HAL Extension module */
/* 包含 RCC HAL 扩展模块 */
#include "stm32f1xx_hal_rcc_ex.h"

/* Exported functions --------------------------------------------------------*/
/* 导出函数 ------------------------------------------------------------------*/
/** @addtogroup RCC_Exported_Functions
  * @{
  */

/** @addtogroup RCC_Exported_Functions_Group1
  * @{
  */

/* Initialization and de-initialization functions  ******************************/
/* 初始化和反初始化函数 **************************************************************/
HAL_StatusTypeDef HAL_RCC_DeInit(void); // RCC 反初始化，将 RCC 寄存器恢复为默认值
HAL_StatusTypeDef HAL_RCC_OscConfig(RCC_OscInitTypeDef  *RCC_OscInitStruct); // 配置系统振荡器
HAL_StatusTypeDef HAL_RCC_ClockConfig(RCC_ClkInitTypeDef  *RCC_ClkInitStruct, uint32_t FLatency); // 配置系统时钟

/**
  * @}
  */

/** @addtogroup RCC_Exported_Functions_Group2
  * @{
  */

/* Peripheral Control functions  ************************************************/
/* 外设控制函数 ****************************************************************/
void              HAL_RCC_MCOConfig(uint32_t RCC_MCOx, uint32_t RCC_MCOSource, uint32_t RCC_MCODiv); // 配置微控制器时钟输出 (MCO)
void              HAL_RCC_EnableCSS(void); // 使能时钟安全系统 (CSS)
void              HAL_RCC_DisableCSS(void); // 禁用时钟安全系统 (CSS)
uint32_t          HAL_RCC_GetSysClockFreq(void); // 获取系统时钟频率
uint32_t          HAL_RCC_GetHCLKFreq(void); // 获取 HCLK 频率
uint32_t          HAL_RCC_GetPCLK1Freq(void); // 获取 PCLK1 频率
uint32_t          HAL_RCC_GetPCLK2Freq(void); // 获取 PCLK2 频率
void              HAL_RCC_GetOscConfig(RCC_OscInitTypeDef  *RCC_OscInitStruct); // 获取振荡器配置
void              HAL_RCC_GetClockConfig(RCC_ClkInitTypeDef  *RCC_ClkInitStruct, uint32_t *pFLatency); // 获取时钟配置

/* CSS NMI IRQ handler */
/* CSS NMI 中断处理程序 */
void              HAL_RCC_NMI_IRQHandler(void); // RCC NMI 中断服务程序

/* User Callbacks in non blocking mode (IT mode) */
/* 非阻塞模式 (中断模式) 下的用户回调函数 */
void              HAL_RCC_CSSCallback(void); // 时钟安全系统中断回调函数

/**
  * @}
  */

/**
  * @}
  */

